clear;clc;
x=[2.4100	0.0441	0.3843	2.0000	1.8870	0.5296
1.1400	0.0071	0.1952	4.0000	1.8350	0.5323
4.6700	0.1259	0.4261	1.0000	2.4560	0.3975
1.5800	0.0090	0.4384	2.0000	2.3560	0.4241
0.9800	0.0870	0.9427	1.0000	1.0240	0.7838
0.5100	0.0792	0.9003	1.0000	1.0000	0.9174
1.6600	0.1013	0.0723	4.0000	2.0300	0.4871
3.8900	0.0754	0.3154	3.0000	1.1060	0.6564
4.5800	0.1825	0.1098	3.0000	1.2660	0.6992
];
[idx,cen]=kmeans(x,3,'replicates',100,'display','final');
%轮廓值、轮廓系数
silhouette(x,idx)
color=['r','g','b'];
figure,
for i=1:3
plot(x(idx==i,1),x(idx==i,2),'color',color(i),'linestyle','none','marker','x')
hold on
end
%质心坐标
a=cen(:,1);
b=cen(:,2);
plot(a,b,'color','k','linestyle','none','marker','*')
hold off
grid on